// <REVIEW> Файлы с расширением tsx и отображающие контент должны быть с большой буквы</REVIEW>
// <REVIEW> переменная должна иметь явный смысл в своем названии</REVIEW>
// <REVIEW> Название файла должна быть в формате CamelCase</REVIEW>
// <REVIEW> Имя типа должно отражать то, что он описывает</REVIEW>
// <REVIEW> Добавьте описание для alt, чтобы улучшить доступность. Это важно для пользователей с ограниченными возможностями.</REVIEW>
// <REVIEW> Рассмотрите возможность сделать нейминг элементов более читаемым</REVIEW>
// <REVIEW> Требование: название интерфейса должно быть в формате <ComponentName>Props, например, BigPictureProps.</REVIEW>
// <REVIEW> Данная константа должна иметь имя BASE_URL</REVIEW>
// <REVIEW> Имя данного компонента не отражает его функциональность</REVIEW>
// <REVIEW> Имена булевых переменных и функций должны быть сформулированы как вопросы, на которые можно ответить "да" или "нет". Например, isVisible, hasError.</REVIEW>
